<template>
  <div class="wrapper">
    <headerr />
    <div class = "title">
      <svg class = "logo" viewBox="0 0 350 19" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M0.44 18H10.28C14.12 18 16.04 15.72 16.04 12.72C16.04 9.72 13.64 8.64 13.64 8.64C13.64 8.616 14.84 7.56 14.84 5.52C14.84 2.4 12.56 1.2 9.68 1.2H0.44V18ZM3.56 7.08V3.96H9.32C11 3.96 11.72 4.68 11.72 5.76C11.72 6.96 10.76 7.8 10.76 7.8L3.56 7.08ZM3.56 15.12V9.84L10.16 10.44C11.84 10.584 12.92 11.04 12.92 12.84C12.92 14.64 11.48 15.12 10.16 15.12H3.56ZM25.4056 18.48C29.4856 18.48 32.6056 17.04 32.6056 13.44C32.6056 6.96 20.8456 9.24 20.8456 6C20.8456 4.8 22.0456 3.6 24.5656 3.6C26.9656 3.6 28.5256 4.68 29.1256 5.88L32.2456 5.28C31.2856 2.88 28.7656 0.719999 24.6856 0.719999C20.1256 0.719999 17.7256 3.36 17.7256 6C17.7256 12.24 29.4856 10.08 29.4856 13.44C29.4856 15 27.5656 15.6 25.4056 15.6C22.4056 15.6 20.6056 13.92 19.8856 13.08L17.2456 14.76C17.9656 15.6 20.1256 18.48 25.4056 18.48ZM43.2959 18.48C48.5759 18.48 50.7359 15.6 51.4559 14.76L48.8159 13.08C48.0959 13.92 46.2959 15.6 43.2959 15.6C39.5759 15.6 37.1759 12.96 37.1759 9.6C37.1759 6.24 39.6959 3.6 43.2959 3.6C46.8959 3.6 48.2159 5.76 48.6959 7.32L51.8159 6.96C51.2159 4.44 49.0559 0.719999 43.2959 0.719999C37.2959 0.719999 34.0559 5.04 34.0559 9.6C34.0559 14.16 37.2959 18.48 43.2959 18.48ZM72.7025 18.48C76.7825 18.48 79.9025 17.04 79.9025 13.44C79.9025 6.96 68.1425 9.24 68.1425 6C68.1425 4.8 69.3425 3.6 71.8625 3.6C74.2625 3.6 75.8225 4.68 76.4225 5.88L79.5425 5.28C78.5825 2.88 76.0625 0.719999 71.9825 0.719999C67.4225 0.719999 65.0225 3.36 65.0225 6C65.0225 12.24 76.7825 10.08 76.7825 13.44C76.7825 15 74.8625 15.6 72.7025 15.6C69.7025 15.6 67.9025 13.92 67.1825 13.08L64.5425 14.76C65.2625 15.6 67.4225 18.48 72.7025 18.48ZM86.8784 18H89.9984V4.08H95.9984V1.2H80.8784V4.08H86.8784V18ZM105.597 18.48C110.997 18.48 113.517 14.88 113.517 10.2V1.2H110.397V10.2C110.397 13.584 108.837 15.48 105.597 15.48C102.597 15.48 100.797 13.56 100.797 10.2V1.2H97.6766V10.2C97.6766 14.88 100.197 18.48 105.597 18.48ZM124.071 18C130.791 18 132.231 14.16 132.231 8.64V1.2H116.151V18H124.071ZM124.071 15.12H119.271V4.08H129.111V8.64C129.111 13.32 128.271 15.12 124.071 15.12ZM134.62 18H137.74V1.2H134.62V18ZM149.14 18.48C155.14 18.48 158.38 14.16 158.38 9.6C158.38 5.04 155.14 0.719999 149.14 0.719999C143.14 0.719999 139.9 5.04 139.9 9.6C139.9 14.16 143.14 18.48 149.14 18.48ZM149.14 15.6C145.54 15.6 143.02 12.96 143.02 9.6C143.02 6.24 145.54 3.6 149.14 3.6C152.74 3.6 155.26 6.24 155.26 9.6C155.26 12.96 152.74 15.6 149.14 15.6Z" fill="black"/>
      </svg>
    </div>
    <div class="line"></div>
    <div class="info">
      <div class="info-item1">О студии</div>
      <div class="info-item2">Мы ценим важнейшие технологии, воздействующие на человеческие эмоции и поведение. Благодаря глубоким исследованиям и созданию прототипов мы комбинируем различные технологии для создания впечатлений. Мы работаем каждый день, чтобы максимизировать ценность опыта, визуализируя концепцию и историю с помощью технологий и дизайна. Теперь, когда граница между реальным и виртуальным удалена, где, с кем и что испытать? Мы используем силу творчества, чтобы дать ответы и определить цель опыта.</div>
    </div>
    <div class="photo"></div>
    <div class="text">
      <div class="text-item1">Каждая наша работа - индивидуальный подход.<br>
        Мы используем комплексный подход в создании сайтов и<br>настроены на долгосрочное сотрудничество. Мы уделяем внимание деталям и действительно любим свою работу.
      </div>
      <div class="text-item2">Мы станем продолжением вашей команды<br>
        Наш процесс работы адаптируется под ваши потребности. Каждый проект неповторим, и наш подход<br>индивидуален.<br>
        Мы изучаем сферу деятельности клиента, разрабатываем концепцию сайта, который будет не просто «красивой картинкой», а реальным инструментом продаж и ведения бизнеса. Ведь каждый сайт должен способствовать повышению конверсии, информировать интернет-сообщество о вашей компании, помогать в решении многих других задач, которые возникают, когда требуется разработка сайта для бизнеса.
      </div>
      <div class="text-item3">
        Мы управляем проектами с помощью различных средств<br>
        Мы строим команду вокруг ваших целей и предоставляем нашим клиентам прямой доступ к каждому члену проекта.<br>
        Сотрудничая с нами, необходимо понимать, что обсуждение проекта и постановка целей - это совместная работа. Чтобы грамотно обозначить все этапы работы над проектом, мы вместе с вами будем разрабатывать техническое задание- важнейший документ, который отражает суть проекта. Чтобы получить по-настоящему эффективный сайт, вы должны четко понимать цели и задачи будущего сайта, либо довериться нашему опыту.
      </div>
    </div>
  </div>
</template>

<script>
import headerr from '@/components/headerblack.vue'
export default {
  name: 'Home',
  components: {
    headerr
  }
}
</script>

<style lang="sass" scoped>
  .wrapper
    margin: 0
    padding: 0
    width: 100%
    background-color: white
    .title
      display: flex
      height: 30vh
      justify-content: space-around
      .logo
        width: 80%;
    .line
      border: 1px solid #000000
      border-radius: 1px
      width: 80%
      margin: 0 10% 4% 10%
    .info
      display: flex
      height: 20vw
      justify-content: space-around
      .info-item1
        width: 10%
        font-size: 1.6vw
        font-weight: bold
      .info-item2
        font-size: 1.3vw
        width: 50%
    .photo
      background-image: url('../assets/photo_main.jpg')
      background-size: contain
      background-repeat: no-repeat
      height: 52.8vw
    .text
      display: flex
      flex-direction: column
      font-size: 1.1vw
      .text-item1
        margin-left: 10vw
        margin-top: 8vh
        max-width: 30vw
        line-height: 1.5
      .text-item2
        margin-top: 8vh
        margin-left: 10vw
        max-width: 40vw
        line-height: 1.5
      .text-item3
        margin-top: 8vh
        margin-left: 10vw
        margin-bottom: 8vh
        max-width: 45vw
        line-height: 1.5
</style>
